------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\covid-vs-noncovid-deaths-research\analysis/output/an_ethnicitybycod_logisticversion.log
  log type:  text
 opened on:  20 Feb 2021, 14:21:49

. 
. frames reset

. use ./analysis/an_impute_imputeddata_MAIN, replace

. 
. for num 1/6: gen outcomeX = onsdeath == X

->  gen outcome1 = onsdeath == 1

->  gen outcome2 = onsdeath == 2

->  gen outcome3 = onsdeath == 3

->  gen outcome4 = onsdeath == 4

->  gen outcome5 = onsdeath == 5

->  gen outcome6 = onsdeath == 6

. 
. cap frame drop estimates

. frame create estimates outcome ethnicity rrr lci uci

. 
. foreach outcome of numlist 1/6{
  2.         if `outcome'==4 local if " if agegroup>1"
  3.         else local if
  4.         mi estimate, or post: logistic outcome`outcome' i.ethnicity age1 age2 age3 i.male i.stp `if'
  5.         foreach ethnicity of numlist 2/5 {
  6.                 cap lincom `ethnicity'.ethnicity, or
  7.                 if _rc==0 frame post estimates (`outcome') (`ethnicity') (r(estimate)) (r(lb)) (r(ub))
  8. }
  9. }

Multiple-imputation estimates                   Imputations       =         10
Logistic regression                             Number of obs     = 17,456,515
                                                Average RVI       =     0.0400
                                                Largest FMI       =     0.4472
DF adjustment:   Large sample                   DF:     min       =      49.74
                                                        avg       =   6.08e+08
                                                        max       =   1.30e+09
Model F test:       Equal FMI                   F(  39,221342.2)  =     872.23
Within VCE type:          OIM                   Prob > F          =     0.0000

-----------------------------------------------------------------------------------------
               outcome1 | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              ethnicity |
                 Mixed  |   1.586162   .1739861     4.21   0.000     1.278367    1.968064
Asian or Asian British  |    1.97324   .0821399    16.33   0.000     1.814946    2.145339
                 Black  |   1.815444   .1114214     9.72   0.000     1.608044    2.049595
                 Other  |   1.380527   .1173174     3.79   0.000     1.167189     1.63286
                        |
                   age1 |   1.156722   .0201538     8.36   0.000     1.117888    1.196905
                   age2 |   .9417349   .0357066    -1.58   0.113     .8742883    1.014385
                   age3 |   1.158418   .1016547     1.68   0.094     .9753705    1.375817
                 1.male |   1.721665   .0269468    34.71   0.000     1.669652    1.775298
                        |
                    stp |
                     2  |   .5192361   .3702864    -0.92   0.358      .128334    2.100816
                     3  |   .3599108    .256881    -1.43   0.152      .088851    1.457899
                     4  |   .7655499   .5476234    -0.37   0.709     .1883999    3.110759
                     5  |   .6509172   .4665777    -0.60   0.549     .1597292    2.652573
                     6  |   .5582145    .398251    -0.82   0.414     .1378867    2.259852
                     7  |   .6357731   .4586477    -0.63   0.530     .1546123    2.614329
                     8  |   .4873502   .3477989    -1.01   0.314     .1203313    1.973802
                     9  |   .1679671   .1202016    -2.49   0.013     .0413125    .6829144
                    10  |   .4585893    .327284    -1.09   0.275     .1132249    1.857401
                    11  |   .3960395   .2826902    -1.30   0.194      .097759    1.604428
                    12  |   .6430742    .459651    -0.62   0.537     .1584333    2.610211
                    13  |   .5286605   .3775504    -0.89   0.372     .1304005    2.143258
                    14  |   .5025886   .3589574    -0.96   0.335     .1239567    2.037771
                    15  |   .2833707   .2024734    -1.76   0.078     .0698484    1.149618
                    16  |   .2028733   .1449424    -2.23   0.026     .0500133    .8229326
                    17  |   .3056967   .2183415    -1.66   0.097     .0753922    1.239524
                    18  |   .4901046   .3498057    -1.00   0.318     .1209915    1.985284
                    19  |   .4195231   .2995181    -1.22   0.224     .1035241    1.700084
                    20  |   .4596908   .3279763    -1.09   0.276     .1135423    1.861118
                    21  |   .5131225   .3661569    -0.94   0.350     .1267114    2.077908
                    22  |   .4604421   .3338225    -1.07   0.285     .1111861    1.906776
                    23  |   .2443522   .1745348    -1.97   0.049     .0602593    .9908519
                    24  |   .4387207   .3197081    -1.13   0.258     .1051704    1.830133
                    25  |   .1196407   .0864549    -2.94   0.003     .0290257    .4931453
                    26  |   .1058265   .0757989    -3.14   0.002     .0259966    .4307975
                    27  |    .280735   .2004904    -1.78   0.075     .0692469    1.138133
                    28  |   .1435981   .1027039    -2.71   0.007     .0353471    .5833689
                    29  |   .2356018   .1684954    -2.02   0.043     .0579996    .9570453
                    30  |   .3631365   .2595066    -1.42   0.156      .089491    1.473534
                    31  |   .2570969   .1957801    -1.78   0.074     .0577968     1.14364
                    32  |   .5521228   .3937628    -0.83   0.405     .1364507    2.234063
                        |
                  _cons |   2.07e-07   1.98e-07   -16.14   0.000     3.20e-08    1.34e-06
-----------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Multiple-imputation estimates                   Imputations       =         10
Logistic regression                             Number of obs     = 17,456,515
                                                Average RVI       =     0.0364
                                                Largest FMI       =     0.3695
DF adjustment:   Large sample                   DF:     min       =      72.49
                                                        avg       =   1.60e+10
                                                        max       =   3.29e+10
Model F test:       Equal FMI                   F(  39,265139.4)  =    1034.67
Within VCE type:          OIM                   Prob > F          =     0.0000

-----------------------------------------------------------------------------------------
               outcome2 | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              ethnicity |
                 Mixed  |   .7741206   .0757617    -2.62   0.010      .637846      .93951
Asian or Asian British  |   .5803946   .0249652   -12.65   0.000     .5327067    .6323516
                 Black  |   .8548377   .0483369    -2.77   0.006     .7643294    .9560635
                 Other  |   .6655014   .0462125    -5.86   0.000     .5805585    .7628725
                        |
                   age1 |   1.089507   .0078123    11.96   0.000     1.074302    1.104927
                   age2 |   1.125565   .0183985     7.24   0.000     1.090076    1.162209
                   age3 |   .6675972   .0259045   -10.41   0.000      .618708    .7203495
                 1.male |   1.410595   .0142313    34.10   0.000     1.382977    1.438766
                        |
                    stp |
                     2  |   .7795097   .4519444    -0.43   0.667      .250214    2.428463
                     3  |   .8185176   .4747053    -0.35   0.730      .262644    2.550872
                     4  |    .800643   .4658177    -0.38   0.702       .25598    2.504216
                     5  |   .7965958    .464071    -0.39   0.696     .2543053    2.495288
                     6  |   .8371075   .4855001    -0.31   0.759     .2686006    2.608888
                     7  |   .9469724   .5541478    -0.09   0.926     .3007687     2.98155
                     8  |   .8212006   .4763441    -0.34   0.734     .2634529    2.559739
                     9  |    .783709   .4546728    -0.42   0.674     .2513772    2.443339
                    10  |   .7903028   .4584226    -0.41   0.685     .2535397    2.463435
                    11  |   .7640718   .4432426    -0.46   0.643     .2451021    2.381888
                    12  |   .9074848   .5273994    -0.17   0.867     .2905025    2.834842
                    13  |    .789051   .4580785    -0.41   0.683     .2528981    2.461867
                    14  |   .7877821   .4572545    -0.41   0.681     .2525462    2.457374
                    15  |   .7011454   .4068374    -0.61   0.541     .2248542    2.186327
                    16  |   .7141626   .4142366    -0.58   0.562     .2291256    2.225977
                    17  |   .7169485    .415955    -0.57   0.566      .229955    2.235286
                    18  |    .703519    .408194    -0.61   0.544     .2256284    2.193602
                    19  |   .6723898   .3901761    -0.68   0.494     .2156173    2.096807
                    20  |   .7318875   .4244776    -0.54   0.590     .2348375    2.280979
                    21  |   .6455963   .3746249    -0.75   0.451     .2070275    2.013233
                    22  |   .6854164   .4040227    -0.64   0.522     .2158782    2.176207
                    23  |   .7558323   .4384216    -0.48   0.629      .242485     2.35595
                    24  |    .659177   .3891238    -0.71   0.480     .2072635    2.096435
                    25  |   .7273314   .4227225    -0.55   0.584     .2328182    2.272206
                    26  |   .7360746   .4269702    -0.53   0.597     .2361406    2.294421
                    27  |    .714092   .4142407    -0.58   0.562     .2290746    2.226032
                    28  |   .7007241   .4064756    -0.61   0.540     .2247929    2.184296
                    29  |   .7378359   .4281953    -0.52   0.600     .2365778    2.301154
                    30  |    .740701   .4299428    -0.52   0.605     .2374431    2.310608
                    31  |   .5070362   .3061637    -1.12   0.261     .1552594    1.655847
                    32  |   .8360927    .484765    -0.31   0.758     .2683671    2.604831
                        |
                  _cons |   4.82e-06   3.05e-06   -19.32   0.000     1.39e-06    .0000167
-----------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Multiple-imputation estimates                   Imputations       =         10
Logistic regression                             Number of obs     = 17,456,515
                                                Average RVI       =     0.0254
                                                Largest FMI       =     0.2700
DF adjustment:   Large sample                   DF:     min       =     133.94
                                                        avg       =   3.63e+10
                                                        max       =   8.47e+10
Model F test:       Equal FMI                   F(  39,531191.3)  =    1667.72
Within VCE type:          OIM                   Prob > F          =     0.0000

-----------------------------------------------------------------------------------------
               outcome3 | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              ethnicity |
                 Mixed  |   1.174143   .1095105     1.72   0.087     .9767573    1.411416
Asian or Asian British  |   1.048089   .0369873     1.33   0.185     .9774293    1.123857
                 Black  |   .9788294   .0566276    -0.37   0.712     .8734896    1.096873
                 Other  |   .6849615   .0546388    -4.74   0.000      .585567    .8012273
                        |
                   age1 |    1.22954   .0147223    17.26   0.000      1.20102    1.258736
                   age2 |   .7720738    .019906   -10.03   0.000     .7340281    .8120915
                   age3 |   1.914254   .1137048    10.93   0.000      1.70388    2.150602
                 1.male |   1.591544   .0175386    42.17   0.000     1.557538    1.626293
                        |
                    stp |
                     2  |   .3557271   .1616465    -2.27   0.023     .1459893    .8667875
                     3  |   .3833393   .1742859    -2.11   0.035     .1572472    .9345094
                     4  |   .3527291   .1614011    -2.28   0.023     .1438634    .8648333
                     5  |   .3355842   .1540099    -2.38   0.017     .1365082    .8249813
                     6  |   .3377351   .1535923    -2.39   0.017     .1385076    .8235283
                     7  |   .3779282   .1750763    -2.10   0.036     .1524361    .9369808
                     8  |   .3261101   .1483536    -2.46   0.014     .1337016    .7954111
                     9  |   .3752667   .1707104    -2.15   0.031     .1538596    .9152828
                    10  |   .3297834   .1500109    -2.44   0.015     .1352187    .8043053
                    11  |   .3130979   .1424388    -2.55   0.011      .128363    .7636958
                    12  |   .4116257   .1878136    -1.95   0.052     .1683148    1.006659
                    13  |   .3052208   .1390775    -2.60   0.009     .1249551    .7455459
                    14  |    .298373   .1359438    -2.65   0.008     .1221624    .7287546
                    15  |   .2845858   .1295392    -2.76   0.006     .1166163    .6944921
                    16  |   .3133532   .1425054    -2.55   0.011     .1285075     .764082
                    17  |   .2841392    .129306    -2.76   0.006     .1164573    .6932594
                    18  |   .2850999   .1297639    -2.76   0.006     .1168343    .6957025
                    19  |    .294304   .1339508    -2.69   0.007     .1206081    .7181508
                    20  |   .2770173   .1259896    -2.82   0.005     .1135989    .6755225
                    21  |   .2746325   .1249929    -2.84   0.005     .1125502    .6701273
                    22  |   .3086301   .1442901    -2.51   0.012     .1234486    .7715967
                    23  |   .2835435   .1289867    -2.77   0.006     .1162518    .6915753
                    24  |   .3584214   .1672132    -2.20   0.028     .1436434    .8943391
                    25  |   .3269732   .1492405    -2.45   0.014     .1336589    .7998828
                    26  |   .3025758   .1376325    -2.63   0.009     .1240648    .7379377
                    27  |   .3147534   .1431722    -2.54   0.011     .1290576    .7676395
                    28  |   .3097938   .1408989    -2.58   0.010      .127038    .7554608
                    29  |   .3664854   .1667804    -2.21   0.027     .1502073    .8941741
                    30  |   .2821096    .128526    -2.78   0.005       .11551    .6889948
                    31  |   .2950755   .1419892    -2.54   0.011     .1149048    .7577539
                    32  |   .3474152   .1578936    -2.33   0.020     .1425587    .8466498
                        |
                  _cons |   1.35e-07   8.50e-08   -25.11   0.000     3.92e-08    4.64e-07
-----------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Multiple-imputation estimates                   Imputations       =         10
Logistic regression                             Number of obs     = 11,489,400
                                                Average RVI       =     0.0398
                                                Largest FMI       =     0.3755
DF adjustment:   Large sample                   DF:     min       =      70.22
                                                        avg       =   9.72e+10
                                                        max       =   9.99e+11
Model F test:       Equal FMI                   F(  38,217381.4)  =     805.95
Within VCE type:          OIM                   Prob > F          =     0.0000

-----------------------------------------------------------------------------------------
               outcome4 | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              ethnicity |
                 Mixed  |   .7755671   .1666539    -1.18   0.241     .5053374    1.190302
Asian or Asian British  |   .6890063   .0459446    -5.59   0.000      .604036    .7859295
                 Black  |   1.207685   .1002215     2.27   0.023     1.026045     1.42148
                 Other  |   .7474369   .1085536    -2.00   0.049     .5594783    .9985408
                        |
                   age1 |   .0180238    .007653    -9.46   0.000     .0078419     .041426
                   age2 |   6582.906   5417.019    10.68   0.000     1312.112    33026.64
                   age3 |   2.59e-09   4.65e-09   -11.01   0.000     7.66e-11    8.76e-08
                 1.male |   .8153504   .0135613   -12.27   0.000     .7891993    .8423679
                        |
                    stp |
                     2  |   .9709682    .036796    -0.78   0.437     .9014627    1.045833
                     3  |   .9616059   .0426044    -0.88   0.377     .8816258    1.048842
                     4  |   1.033093   .0913137     0.37   0.713     .8687659    1.228502
                     5  |   1.083858   .1052633     0.83   0.407     .8959929    1.311114
                     6  |   1.074223   .0474315     1.62   0.105      .985168    1.171328
                     7  |   1.387827   .1673206     2.72   0.007     1.095751    1.757757
                     8  |   .9366908   .0453419    -1.35   0.177     .8519078    1.029911
                     9  |   .9424799   .0470446    -1.19   0.235     .8546409    1.039347
                    10  |    .991624     .04644    -0.18   0.857     .9046558    1.086953
                    11  |   .9587607   .0461902    -0.87   0.382     .8723724    1.053704
                    12  |   .8844993   .0708666    -1.53   0.126     .7559598    1.034895
                    13  |   .8305096   .0512016    -3.01   0.003     .7359823    .9371777
                    14  |   .9476801   .0556635    -0.91   0.360     .8446273    1.063306
                    15  |   .8488554   .0444488    -3.13   0.002     .7660587    .9406008
                    16  |   .9439438   .0415073    -1.31   0.190     .8659981    1.028905
                    17  |   .8843312    .043435    -2.50   0.012     .8031695    .9736945
                    18  |   .9320515   .0478801    -1.37   0.171     .8427777    1.030782
                    19  |   .9480151   .0473315    -1.07   0.285     .8596414    1.045474
                    20  |   1.035654   .0439039     0.83   0.409      .953082     1.12538
                    21  |   .7093504   .0406183    -6.00   0.000     .6340443    .7936007
                    22  |    .818301   .1457851    -1.13   0.260     .5771205    1.160271
                    23  |   .8181774   .0383149    -4.29   0.000     .7464248    .8968274
                    24  |   1.282629   .1763651     1.81   0.070     .9796221     1.67936
                    25  |   .6938389   .0558739    -4.54   0.000     .5925329    .8124652
                    26  |   .7486752   .0362928    -5.97   0.000     .6808172    .8232966
                    27  |   .8651549   .0410079    -3.06   0.002     .7884013    .9493808
                    28  |   .8148043   .0373703    -4.47   0.000     .7447556    .8914416
                    29  |   .7592441   .0426432    -4.90   0.000      .680101     .847597
                    30  |   .8172757   .0480081    -3.44   0.001     .7283962    .9170004
                    31  |   .6089444   .1647312    -1.83   0.067     .3583532     1.03477
                    32  |          1  (omitted)
                        |
                  _cons |   2.50e+57   4.04e+58     8.18   0.000     4.44e+43    1.41e+71
-----------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Multiple-imputation estimates                   Imputations       =         10
Logistic regression                             Number of obs     = 17,453,964
                                                Average RVI       =     0.0134
                                                Largest FMI       =     0.1513
DF adjustment:   Large sample                   DF:     min       =     415.08
                                                        avg       =   9.80e+10
                                                        max       =   7.30e+11
Model F test:       Equal FMI                   F(  38, 1.8e+06)  =     714.61
Within VCE type:          OIM                   Prob > F          =     0.0000

-----------------------------------------------------------------------------------------
               outcome5 | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              ethnicity |
                 Mixed  |   .7739596   .1244295    -1.59   0.111     .5646315    1.060893
Asian or Asian British  |   .8307059   .0454778    -3.39   0.001     .7459525    .9250887
                 Black  |   .6416948   .0664733    -4.28   0.000      .523542    .7865122
                 Other  |   .6024985   .0764956    -3.99   0.000     .4695976    .7730117
                        |
                   age1 |    1.08688   .0193852     4.67   0.000     1.049542    1.125546
                   age2 |   1.116784   .0444053     2.78   0.005     1.033057    1.207298
                   age3 |   .7572323   .0704148    -2.99   0.003      .631068    .9086197
                 1.male |   1.479969   .0242996    23.88   0.000     1.433101     1.52837
                        |
                    stp |
                     2  |   1.001099   .0383399     0.03   0.977     .9287057    1.079136
                     3  |   1.027098   .0456372     0.60   0.547     .9414353    1.120556
                     4  |   1.338754   .1043078     3.74   0.000     1.149159    1.559629
                     5  |   .9845504   .0994235    -0.15   0.877     .8077565    1.200039
                     6  |   .9912442   .0456334    -0.19   0.849     .9057209    1.084843
                     7  |   1.037188   .1459932     0.26   0.795     .7871249    1.366695
                     8  |    .916001   .0455827    -1.76   0.078     .8308791    1.009843
                     9  |   .8884035    .046239    -2.27   0.023      .802246    .9838139
                    10  |   .8860543    .044037    -2.43   0.015      .803814    .9767089
                    11  |   .9373161   .0463022    -1.31   0.190     .8508204    1.032605
                    12  |   1.347486   .0936982     4.29   0.000     1.175805    1.544234
                    13  |   .9086086   .0564123    -1.54   0.123     .8045049    1.026183
                    14  |   1.042129   .0600225     0.72   0.474     .9308838    1.166668
                    15  |   .9147448   .0479155    -1.70   0.089      .825492    1.013648
                    16  |   .8263887   .0391177    -4.03   0.000     .7531685    .9067271
                    17  |   .7875251   .0416791    -4.51   0.000     .7099296    .8736018
                    18  |   .8632043   .0461986    -2.75   0.006      .777244    .9586714
                    19  |   .8528644   .0457546    -2.97   0.003     .7677408    .9474262
                    20  |   .8487583   .0391633    -3.55   0.000     .7753682     .929095
                    21  |   .7946676   .0443883    -4.11   0.000     .7122611    .8866084
                    22  |   1.035567    .167251     0.22   0.829     .7545771    1.421193
                    23  |   .7735542   .0385862    -5.15   0.000     .7015059    .8530023
                    24  |   .7241412   .1364352    -1.71   0.087     .5005513    1.047606
                    25  |   .8809239   .0662231    -1.69   0.092     .7602381    1.020768
                    26  |   .7800292   .0388105    -4.99   0.000     .7075534     .859929
                    27  |   .7076832   .0371255    -6.59   0.000     .6385345    .7843204
                    28  |   .7606344   .0374793    -5.55   0.000      .690612    .8377565
                    29  |   .9275522   .0506818    -1.38   0.169     .8333519    1.032401
                    30  |   .7671405   .0479083    -4.24   0.000     .6787611    .8670276
                    31  |   .8750662   .2029553    -0.58   0.565     .5554187    1.378673
                    32  |          1  (omitted)
                        |
                  _cons |   6.38e-07   4.09e-07   -22.22   0.000     1.81e-07    2.24e-06
-----------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

Multiple-imputation estimates                   Imputations       =         10
Logistic regression                             Number of obs     = 17,456,515
                                                Average RVI       =     0.0322
                                                Largest FMI       =     0.3485
DF adjustment:   Large sample                   DF:     min       =      81.30
                                                        avg       =   5.23e+10
                                                        max       =   8.04e+10
Model F test:       Equal FMI                   F(  39,336773.0)  =    1632.61
Within VCE type:          OIM                   Prob > F          =     0.0000

-----------------------------------------------------------------------------------------
               outcome6 | Odds Ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              ethnicity |
                 Mixed  |   .8316419   .1018373    -1.51   0.136     .6518223    1.061069
Asian or Asian British  |   .8498472   .0345438    -4.00   0.000     .7842956    .9208776
                 Black  |   .8938127   .0572092    -1.75   0.080     .7880423     1.01378
                 Other  |    .681193   .0587916    -4.45   0.000     .5746681    .8074642
                        |
                   age1 |   1.124629   .0065148    20.28   0.000     1.111932     1.13747
                   age2 |   .8020649   .0114908   -15.40   0.000     .7798566    .8249056
                   age3 |   2.028546   .0709777    20.22   0.000     1.894095    2.172541
                 1.male |   1.220431   .0150698    16.13   0.000      1.19125    1.250328
                        |
                    stp |
                     2  |   1.619649   1.624027     0.48   0.631     .2269437    11.55908
                     3  |   1.387498   1.391554     0.33   0.744     .1943314    9.906539
                     4  |   1.881864   1.889859     0.63   0.529     .2628877     13.4712
                     5  |   1.326083   1.333663     0.28   0.779     .1847156    9.520017
                     6  |    1.56748   1.572029     0.45   0.654     .2195486    11.19112
                     7  |   1.756679   1.770149     0.56   0.576      .243761    12.65962
                     8  |   1.460979   1.465367     0.38   0.705     .2045908    10.43282
                     9  |   1.440752   1.445186     0.36   0.716     .2017288    10.28988
                    10  |   1.500925   1.505382     0.40   0.686     .2101984    10.71737
                    11  |   1.529149   1.533702     0.42   0.672      .214148    10.91907
                    12  |   1.909439   1.916604     0.64   0.519     .2669994     13.6553
                    13  |   1.638658   1.644042     0.49   0.623     .2293456     11.7081
                    14  |   1.528912   1.533944     0.42   0.672      .213983     10.9241
                    15  |   1.241864   1.245796     0.22   0.829     .1738514    8.870952
                    16  |   1.448957   1.453173     0.37   0.712     .2029446    10.34508
                    17  |   1.519566   1.524131     0.42   0.677     .2127946    10.85121
                    18  |   1.491814   1.496359     0.40   0.690      .208891    10.65392
                    19  |    1.53921   1.543889     0.43   0.667     .2155307    10.99225
                    20  |   1.402139   1.406189     0.34   0.736     .1963954    10.01039
                    21  |   1.246517   1.250379     0.22   0.826     .1745258    8.903007
                    22  |   1.094446   1.107945     0.09   0.929     .1504852    7.959666
                    23  |   1.391628   1.395739     0.33   0.742     .1948978    9.936632
                    24  |   1.465557   1.480978     0.38   0.705     .2022297    10.62088
                    25  |   1.105173   1.109972     0.10   0.921     .1543594    7.912753
                    26  |   1.359941   1.363987     0.31   0.759     .1904521    9.710783
                    27  |   1.455459   1.459768     0.37   0.708      .203835    10.39253
                    28  |   1.325769   1.329696     0.28   0.779     .1856714    9.466525
                    29  |   1.083275   1.086939     0.08   0.936     .1515855    7.741396
                    30  |   1.562976   1.568025     0.45   0.656     .2187768    11.16615
                    31  |   1.547251   1.572721     0.43   0.668     .2110313    11.34422
                    32  |   1.701752   1.706395     0.53   0.596     .2384364    12.14564
                        |
                  _cons |   2.55e-06   2.61e-06   -12.60   0.000     3.45e-07    .0000189
-----------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. frame change estimates

. 
. sort ethnicity outcome

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed vs White"                                      ///
>                                                 3 "Asian or Asian British vs White"     ///
>                                                 4 "Black vs White"                                      ///
>                                                 5 "Other vs White"                                      

.                                                 
. label values ethnicity ethnicity

. 
. label define outcomes 1 COVID 2 CANCER 3 CVD 4 DEM_ALZ 5 RESPIR 6 OTHER 

. label values outcome outcomes

. 
. gen outcometext = "COVID-19" if outcome==1
(20 missing values generated)

. replace outcometext = "Cancer" if outcome==2
(4 real changes made)

. replace outcometext = "CVD" if outcome==3
(4 real changes made)

. replace outcometext = "Dementia/Alzheim" if outcome==4
variable outcometext was str8 now str16
(4 real changes made)

. replace outcometext = "Respiratory" if outcome==5
(4 real changes made)

. replace outcometext = "Other" if outcome==6
(4 real changes made)

. 
. gen esthr = string(rrr, "%4.2f") + " (" + string(lci, "%4.2f") + "-" + string(uci, "%4.2f") + ")"

. 
. gen graphorder = 7-outcome

. 
. gen labelat = .
(24 missing values generated)

. replace labelat = 0.06
(24 real changes made)

. gen outcomeheadat = .
(24 missing values generated)

. replace outcomeheadat = 0.05
(24 real changes made)

. gen estimatesat = 3.5

. 
. expand 2 if outcome==1, gen(expanded)
(4 observations created)

. replace graphorder=7 if expanded==1
(4 real changes made)

. gen outcomehead="Cause of death category" if expanded==1
(24 missing values generated)

. for var rrr lci uci : replace X=. if expanded==1

->  replace rrr=. if expanded==1
(4 real changes made, 4 to missing)

->  replace lci=. if expanded==1
(4 real changes made, 4 to missing)

->  replace uci=. if expanded==1
(4 real changes made, 4 to missing)

. replace outcometext="" if expanded==1
(4 real changes made)

. replace esthr="" if expanded==1
(4 real changes made)

. 
. scatter graphorder rrr if outcome==1, mcol(black) ///
>         || rcap lci uci graphorder if outcome==1, hor lcol(black) ///
>         || scatter graphorder rrr if outcome>1 , mcol(gs10) ///
>         || rcap lci uci graphorder if outcome>1, hor lcol(gs10) ///
>         || scatter graphorder labelat, m(i) mlab(outcometext) mlabcol(black) mlabsize(small) ///
>         || scatter graphorder outcomeheadat if graphorder==7, m(i) mlab(outcomehead) mlabcol(black) ///
>         || scatter graphorder estimatesat , m(i) mlab(esthr) mlabcol(black) mlabsize(vsmall) ///
>         ||, yscale(off r(0 7) lcol(white)) ytitle("") ylab(none) legend(off) xscale(log r(13)) xlab(.5 1 2 4) xtitle(Odds ratio for cause-specific death and 95% CI) xline(1, lp(dash)) ///
>         by(ethnicity, legend(off) ) 

.         
. graph export ./analysis/output/an_ethnicitybycod_logisticversion.svg, as(svg) replace
(file ./analysis/output/an_ethnicitybycod_logisticversion.svg written in SVG format)

. 
. log close
      name:  <unnamed>
       log:  E:\analyses\covid-vs-noncovid-deaths-research\analysis/output/an_ethnicitybycod_logisticversion.log
  log type:  text
 closed on:  20 Feb 2021, 18:04:51
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
