--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\covid-vs-noncovid-deaths-research\analysis/output/an_flowchart.log
  log type:  text
 opened on:  19 Nov 2020, 10:50:16

. 
. cap drop corr

. gen corr=8900 /*N additional patients added to dB between main run and flow chart run*/

. 
. count
  30,801,337

. di r(N)-corr
30792437

. 
. count if under_fup_1feb==1
  23,824,270

. di r(N)-corr
23815370

. 
. count if under_fup_1feb==1 & has_12 != 1
  1,977,793

. 
. count if under_fup_1feb==1 & has_12 == 1
  21,846,477

. di r(N)-corr
21837577

. 
. log close
      name:  <unnamed>
       log:  E:\analyses\covid-vs-noncovid-deaths-research\analysis/output/an_flowchart.log
  log type:  text
 closed on:  19 Nov 2020, 10:50:17
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
