-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/analysis/output/cr_create_analysis_dataset.log
  log type:  text
 opened on:  14 Dec 2020, 11:08:55

. 
. clear

. noi di "import delimited ./output/`inputfile'"
import delimited ./output/input.csv

. import delimited ./output/`inputfile'
(53 vars, 21,860,158 obs)

. 
. di "STARTING COUNT FROM IMPORT:"
STARTING COUNT FROM IMPORT:

. cou
  21,860,158

. 
. rename hiv hiv_code

. 
. ****************************
. *  Create required cohort  *
. ****************************
. 
. * DROP IF DIED ON/BEFORE STUDY START DATE
. noi di "DIED ON/BEFORE STUDY START DATE:" 
DIED ON/BEFORE STUDY START DATE:

. if "`dataset'"=="2019" drop if date(died_date_1ocare, "YMD")<=d(1/2/2019)

. else drop if date(died_date_ons, "YMD")<=`studystart'
(4,976 observations deleted)

. 
. 
. * Age: Exclude children
. noi di "DROPPING AGE<18:" 
DROPPING AGE<18:

. drop if age<18
(4,259,763 observations deleted)

. 
. 
. * Age: Exclude those with implausible ages
. assert age<.

. noi di "DROPPING AGE<105:" 
DROPPING AGE<105:

. drop if age>105
(129 observations deleted)

. 
. * Sex: Exclude categories other than M and F
. assert inlist(sex, "M", "F", "I", "U")

. noi di "DROPPING GENDER NOT M/F:" 
DROPPING GENDER NOT M/F:

. drop if inlist(sex, "I", "U")
(284 observations deleted)

. 
. 
. ******************************
. *  Convert strings to dates  *
. ******************************
. 
. * Covariates
. foreach var of varlist  bp_sys_date                                     ///
>                                                 bp_dias_date                 
>                    ///
>                                                 hba1c_percentage_date        
>            ///
>                                                 hba1c_mmol_per_mol_date      
>            ///
>                                                 hypertension                 
>                    ///
>                                                 bmi_date_measured            
>                    ///
>                                                 chronic_respiratory_disease  
>    ///
>                                                 chronic_cardiac_disease      
>            ///
>                                                 diabetes                     
>                            ///
>                                                 lung_cancer                  
>                    ///
>                                                 haem_cancer                  
>                            ///
>                                                 other_cancer                 
>                    ///
>                                                 chronic_liver_disease        
>            ///
>                                                 stroke                       
>                            ///
>                                                 dementia                     
>                            ///
>                                                 other_neuro                  
>                    ///
>                                                 organ_transplant             
>                    ///     
>                                                 dysplenia                    
>                            ///
>                                                 sickle_cell                  
>                    ///
>                                                 aplastic_anaemia             
>                    ///
>                                                 hiv_date                     
>                            ///
>                                                 permanent_immunodeficiency   
>            ///
>                                                 temporary_immunodeficiency   
>            ///
>                                                 ra_sle_psoriasis  dialysis   
>    {
  2.         confirm string variable `var'
  3.         replace `var' = `var' + "-15"
  4.         rename `var' `var'_dstr
  5.         replace `var'_dstr = " " if `var'_dstr == "-15"
  6.         gen `var'_date = date(`var'_dstr, "YMD") 
  7.         order `var'_date, after(`var'_dstr)
  8.         drop `var'_dstr
  9.         format `var'_date %td
 10. }
variable bp_sys_date_measured was str7 now str10
(17,595,006 real changes made)
(1,746,385 real changes made)
(1,746,385 missing values generated)
variable bp_dias_date_measured was str7 now str10
(17,595,006 real changes made)
(1,748,315 real changes made)
(1,748,315 missing values generated)
variable hba1c_percentage_date was str7 now str10
(17,595,006 real changes made)
(13,552,392 real changes made)
(13,552,392 missing values generated)
variable hba1c_mmol_per_mol_date was str7 now str10
(17,595,006 real changes made)
(8,165,261 real changes made)
(8,165,261 missing values generated)
variable hypertension was str7 now str10
(17,595,006 real changes made)
(13,776,821 real changes made)
(13,776,821 missing values generated)
variable bmi_date_measured was str7 now str10
(17,595,006 real changes made)
(3,541,026 real changes made)
(3,541,026 missing values generated)
variable chronic_respiratory_disease was str7 now str10
(17,595,006 real changes made)
(16,851,075 real changes made)
(16,851,075 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(17,595,006 real changes made)
(16,348,850 real changes made)
(16,348,850 missing values generated)
variable diabetes was str7 now str10
(17,595,006 real changes made)
(15,747,123 real changes made)
(15,747,123 missing values generated)
variable lung_cancer was str7 now str10
(17,595,006 real changes made)
(17,555,363 real changes made)
(17,555,363 missing values generated)
variable haem_cancer was str7 now str10
(17,595,006 real changes made)
(17,486,044 real changes made)
(17,486,044 missing values generated)
variable other_cancer was str7 now str10
(17,595,006 real changes made)
(16,685,676 real changes made)
(16,685,676 missing values generated)
variable chronic_liver_disease was str7 now str10
(17,595,006 real changes made)
(17,485,727 real changes made)
(17,485,727 missing values generated)
variable stroke was str7 now str10
(17,595,006 real changes made)
(17,195,532 real changes made)
(17,195,532 missing values generated)
variable dementia was str7 now str10
(17,595,006 real changes made)
(17,547,237 real changes made)
(17,547,237 missing values generated)
variable other_neuro was str7 now str10
(17,595,006 real changes made)
(17,414,549 real changes made)
(17,414,549 missing values generated)
variable organ_transplant was str7 now str10
(17,595,006 real changes made)
(17,573,982 real changes made)
(17,573,982 missing values generated)
variable dysplenia was str7 now str10
(17,595,006 real changes made)
(17,569,220 real changes made)
(17,569,220 missing values generated)
variable sickle_cell was str7 now str10
(17,595,006 real changes made)
(17,591,516 real changes made)
(17,591,516 missing values generated)
variable aplastic_anaemia was str7 now str10
(17,595,006 real changes made)
(17,593,142 real changes made)
(17,593,142 missing values generated)
variable hiv_date was str7 now str10
(17,595,006 real changes made)
(17,566,632 real changes made)
(17,566,632 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(17,595,006 real changes made)
(17,580,733 real changes made)
(17,580,733 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(17,595,006 real changes made)
(17,547,305 real changes made)
(17,547,305 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(17,595,006 real changes made)
(16,686,017 real changes made)
(16,686,017 missing values generated)
variable dialysis was str7 now str10
(17,595,006 real changes made)
(17,568,598 real changes made)
(17,568,598 missing values generated)

. 
. rename bmi_date_measured_date      bmi_date_measured

. rename bp_dias_date_measured_date  bp_dias_date

. rename bp_sys_date_measured_date   bp_sys_date

. rename hba1c_percentage_date_date  hba1c_percentage_date

. rename hba1c_mmol_per_mol_date_date  hba1c_mmol_per_mol_date

. rename hiv_date_date hiv_date

. 
. * Dates of: CPNS death, ONS-covid death
. foreach var of varlist  died_date_ons died_date_cpns died_date_1ocare {
  2.                 confirm string variable `var'
  3.                 rename `var' _tmp
  4.                 gen `var' = date(_tmp, "YMD")
  5.                 drop _tmp
  6.                 format %d `var'
  7. }
(17,441,884 missing values generated)
(17,580,821 missing values generated)
(17,438,284 missing values generated)

.  
.  
. ********* DEFAULT CENSORING IS MAX OUTCOME DATE MINUS 7 **********
. foreach var of varlist  died_date_ons died_date_cpns {
  2.                 *Set default censoring date as max observed minus 7 days
.                 local globstem = substr("`var'",11,.)
  3.                 summ `var'
  4.                 global `globstem'deathcensor = r(max)-7
  5. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
died_dat~ons |    153,122    22079.02    81.64476      21947      22235

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
died_dat~pns |     14,185    22090.18    93.41392      21976      22253

. if "`dataset'"=="2019" global onsdeathcensor = $onsdeathcensor-365

. global primarycaredeathcensor = $onsdeathcensor

. 
. ******************INPUT HERE TO OVERRIDE******************
. *Set censoring dates manually here if needed
. *global cpnsdeathcensor                 = d("25/04/2020")
. *global onscoviddeathcensor     = d("06/05/2020")
. *****************************************************************************
> **
. 
. 
. *******************************
. *  Recode implausible values  *
. *******************************
. 
. 
. * BMI 
. 
. * Only keep if within certain time period? using bmi_date_measured ?
. * NB: Some BMI dates in future or after cohort entry
. 
. * Set implausible BMIs to missing:
. replace bmi = . if !inrange(bmi, 15, 50)
(3,733,556 real changes made, 3,733,556 to missing)

. 
. 
. 
. 
. **********************
. *  Recode variables  *
. **********************
. 
. * Sex
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. 
. 
. * Smoking
. label define smoke 1 "Never" 2 "Former" 3 "Current" 

. 
. gen     smoke = 1  if smoking_status=="N"
(9,516,147 missing values generated)

. replace smoke = 2  if smoking_status=="E"
(5,790,609 real changes made)

. replace smoke = 3  if smoking_status=="S"
(2,989,141 real changes made)

. replace smoke = . if smoking_status=="M"
(0 real changes made)

. label values smoke smoke

. drop smoking_status

. 
. 
. * Ethnicity (5 category)
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                    
>                    ///
>                                                 3 "Asian or Asian British"   
>    ///
>                                                 4 "Black"                    
>                    ///
>                                                 5 "Other"                    
>                    

.                                                 
. label values ethnicity ethnicity

. 
. 
. * Ethnicity (16 category)
. replace ethnicity_16 = . if ethnicity==.
(0 real changes made)

. label define ethnicity_16                                                    
>                    ///
>                                                 1 "British or Mixed British" 
>            ///
>                                                 2 "Irish"                    
>                                    ///
>                                                 3 "Other White"              
>                            ///
>                                                 4 "White + Black Caribbean"  
>            ///
>                                                 5 "White + Black African"    
>                    ///
>                                                 6 "White + Asian"            
>                            ///
>                                                 7 "Other mixed"              
>                            ///
>                                                 8 "Indian or British Indian" 
>            ///
>                                                 9 "Pakistani or British Pakis
> tani"      ///
>                                                 10 "Bangladeshi or British Ba
> ngladeshi" ///
>                                                 11 "Other Asian"             
>                            ///
>                                                 12 "Caribbean"               
>                            ///
>                                                 13 "African"                 
>                            ///
>                                                 14 "Other Black"             
>                            ///
>                                                 15 "Chinese"                 
>                            ///
>                                                 16 "Other"                   
>                                    

.                                                 
. label values ethnicity_16 ethnicity_16

. 
. 
. * Ethnicity (16 category grouped further)
. * Generate a version of the full breakdown with mixed in one group
. gen ethnicity_16_combinemixed = ethnicity_16
(4,453,758 missing values generated)

. recode ethnicity_16_combinemixed 4/7 = 4
(ethnicity_16_combinemixed: 133874 changes made)

. label define ethnicity_16_combinemixed  ///
>                                                 1 "British or Mixed British" 
> ///
>                                                 2 "Irish" ///
>                                                 3 "Other White" ///
>                                                 4 "All mixed" ///
>                                                 8 "Indian or British Indian" 
> ///
>                                                 9 "Pakistani or British Pakis
> tani" ///
>                                                 10 "Bangladeshi or British Ba
> ngladeshi" ///
>                                                 11 "Other Asian" ///
>                                                 12 "Caribbean" ///
>                                                 13 "African" ///
>                                                 14 "Other Black" ///
>                                                 15 "Chinese" ///
>                                                 16 "Other" 

.                                                 
. label values ethnicity_16_combinemixed ethnicity_16_combinemixed

.                                                 
. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(17,594,974 missing values generated)

. replace stp = sum(stp)
(17,595,005 real changes made)

. drop stp_old

. 
. 
. 
. 
. **************************
. *  Categorise variables  *
. **************************
. 
. 
. /*  Age variables  */ 
. 
. * Create categorised age
. recode age 18/39.9999=1 40/49.9999=2 50/59.9999=3 ///
>         60/69.9999=4 70/79.9999=5 80/max=6, gen(agegroup) 
(17595006 differences between age and agegroup)

. 
. label define agegroup   1 "18-<40" ///
>                                                 2 "40-<50" ///
>                                                 3 "50-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

. label values agegroup agegroup

. 
. 
. * Create binary age
. recode age min/69.999=0 70/max=1, gen(age70)
(17595006 differences between age and age70)

. 
. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. assert age70<.

. 
. * Create restricted cubic splines fir age
. mkspline age = age, cubic nknots(4)

. 
. 
. 
. /*  Body Mass Index  */
. 
. * BMI (NB: watch for missingness)
. gen     bmicat = .
(17,595,006 missing values generated)

. recode  bmicat . = 1 if bmi<18.5
(bmicat: 322208 changes made)

. recode  bmicat . = 2 if bmi<25
(bmicat: 4885806 changes made)

. recode  bmicat . = 3 if bmi<30
(bmicat: 4788711 changes made)

. recode  bmicat . = 4 if bmi<35
(bmicat: 2438195 changes made)

. recode  bmicat . = 5 if bmi<40
(bmicat: 947191 changes made)

. recode  bmicat . = 6 if bmi<.
(bmicat: 479339 changes made)

. replace bmicat = . if bmi>=.
(0 real changes made)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    

.                                         
. label values bmicat bmicat

. 
. * Create more granular categorisation
. recode bmicat 1/3 . = 1 4=2 5=3 6=4, gen(obese4cat)
(17272798 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. 
. 
. /*  Smoking  */
. 
. 
. * Create non-missing 3-category variable for current smoking
. recode smoke .=1, gen(smoke_nomiss)
(736397 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. 
. 
. /*  Asthma  */
. 
. 
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. rename asthma asthmacat

. recode asthmacat 0=1 1=2 2=3 .=1
(asthmacat: 17595006 changes made)

. label define asthmacat 1 "No" 2 "Yes, no OCS" 3 "Yes with OCS"

. label values asthmacat asthmacat

. 
. gen asthma = (asthmacat==2|asthmacat==3)

. 
. 
. 
. 
. 
. /*  Blood pressure   */
. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(11,968,637 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(3,048,081 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(8,126,802 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(3,793,059 real changes made)

. replace bpcat = . if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(1,752,919 real changes made, 1,752,919 to missing)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" 

. label values bpcat bpcat

. 
. recode bpcat .=1, gen(bpcat_nomiss)
(1752919 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. order bpcat bphigh, after(bp_dias_date)

. 
. 
. 
. 
. /*  IMD  */
. 
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. replace imd = imd + 1
(17,595,006 real changes made)

. replace imd = . if imd_o==-1
(138,491 real changes made, 138,491 to missing)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5=1 4=2 3=3 2=4 1=5 .=.
(imd: 13941329 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" 

. label values imd imd 

. 
. noi di "DROPPING IF NO IMD" 
DROPPING IF NO IMD

. drop if imd>=.
(138,491 observations deleted)

. 
. 
. 
. 
. 
. /*  Centred age, sex, IMD, ethnicity (for adjusted KM plots)  */ 
. 
. * Centre age (linear)
. summ age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age | 17,456,515    49.76792    18.71148         18        105

. gen c_age = age-r(mean)

. 
. * "Centre" sex to be coded -1 +1 
. recode male 0=-1, gen(c_male)
(8739169 differences between male and c_male)

. 
. * "Centre" IMD
. gen c_imd = imd - 3

. 
. * "Centre" ethnicity
. gen c_ethnicity = ethnicity - 3
(4,427,301 missing values generated)

. 
. 
. 
. 
. **************************************************
. *  Create binary comorbidity indices from dates  *
. **************************************************
. 
. * Comorbidities ever before
. foreach var of varlist  chronic_respiratory_disease_date        ///
>                                                 chronic_cardiac_disease_date 
>            ///
>                                                 diabetes                     
>                                    ///
>                                                 chronic_liver_disease_date   
>                    ///
>                                                 stroke_date                  
>                                    ///
>                                                 dementia_date                
>                            ///
>                                                 other_neuro_date             
>                            ///
>                                                 organ_transplant_date        
>                    ///
>                                                 aplastic_anaemia_date        
>                    ///
>                                                 hypertension                 
>                            ///
>                                                 dysplenia_date               
>                            ///
>                                                 sickle_cell_date             
>                            ///
>                                                 hiv_date                     
>                                    ///
>                                                 permanent_immunodeficiency_da
> te         ///
>                                                 temporary_immunodeficiency_da
> te         ///
>                                                 ra_sle_psoriasis_date dialysi
> s_date {
  2.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'< `studystart')
  4.         order `newvar', after(`var')
  5. }

. 
. 
. 
. 
. 
. 
. ***************************
. *  Grouped comorbidities  *
. ***************************
. 
. 
. /*  Neurological  */
. 
. * Stroke and dementia
. egen stroke_dementia = rowmax(stroke dementia)

. order stroke_dementia, after(dementia_date)

. 
. 
. /*  Spleen  */
. 
. * Spleen problems (dysplenia/splenectomy/etc and sickle cell disease)   
. egen spleen = rowmax(dysplenia sickle_cell) 

. order spleen, after(sickle_cell)

. 
. 
. 
. /*  Cancer  */
. 
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. local fiveybefore = `studystart'-5*365.25

. local oneybefore = `studystart'-365.25

. 
. * Haematological malignancies
. gen     cancer_haem_cat = 4 if inrange(haem_cancer_date, d(1/1/1900), `fiveyb
> efore')
(17,392,493 missing values generated)

. replace cancer_haem_cat = 3 if inrange(haem_cancer_date, `fiveybefore', `oney
> before')
(28,130 real changes made)

. replace cancer_haem_cat = 2 if inrange(haem_cancer_date, `oneybefore', `study
> start')
(8,878 real changes made)

. recode  cancer_haem_cat . = 1
(cancer_haem_cat: 17355485 changes made)

. label values cancer_haem_cat cancer

. 
. 
. * All other cancers
. gen     cancer_exhaem_cat = 4 if inrange(lung_cancer_date,  d(1/1/1900), `fiv
> eybefore') | ///
>                                                                  inrange(othe
> r_cancer_date, d(1/1/1900), `fiveybefore') 
(16,905,660 missing values generated)

. replace cancer_exhaem_cat = 3 if inrange(lung_cancer_date,  `fiveybefore', `o
> neybefore') | ///
>                                                                  inrange(othe
> r_cancer_date, `fiveybefore', `oneybefore') 
(238,243 real changes made)

. replace cancer_exhaem_cat = 2 if inrange(lung_cancer_date,  `oneybefore', `st
> udystart') | ///
>                                                                  inrange(othe
> r_cancer_date, `oneybefore', `studystart')
(81,070 real changes made)

. recode  cancer_exhaem_cat . = 1
(cancer_exhaem_cat: 16590336 changes made)

. label values cancer_exhaem_cat cancer

. 
. 
. * Put variables together
. order cancer_exhaem_cat cancer_haem_cat, after(other_cancer_date)

. 
. 
. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * HIV, permanent immunodeficiency ever, OR 
. * temporary immunodeficiency or aplastic anaemia last year
. gen temp1  = max(hiv, permanent_immunodeficiency)

. gen temp2  = inrange(temporary_immunodeficiency_date, `oneybefore', `studysta
> rt')

. gen temp3  = inrange(aplastic_anaemia_date, `oneybefore', `studystart')

. 
. egen other_immunosuppression = rowmax(temp1 temp2 temp3)

. drop temp1 temp2 temp3

. order other_immunosuppression, after(temporary_immunodeficiency)

. 
. 
. 
. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 2220820 changes made)

. 
. 
. 
. 
. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing
> )
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(4,435,624 real changes made, 4,435,624 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(4,435,624 missing values generated)

. 
. gen min=.
(17,456,515 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(7,075,143 real changes made)

. replace min = SCr_adj/0.9 if male==1
(5,945,748 real changes made)

. replace min = min^-0.329  if male==0
(7,075,142 real changes made)

. replace min = min^-0.411  if male==1
(5,945,748 real changes made)

. replace min = 1 if min<1
(8,600,653 real changes made)

. 
. gen max=.
(17,456,515 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(7,075,143 real changes made)

. replace max=SCr_adj/0.9 if male==1
(5,945,748 real changes made)

. replace max=max^-1.209
(13,020,890 real changes made)

. replace max=1 if max>1
(8,855,861 real changes made)

. 
. gen egfr=min*max*141
(4,435,624 missing values generated)

. replace egfr=egfr*(0.993^age)
(13,020,891 real changes made)

. replace egfr=egfr*1.018 if male==0
(7,075,143 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(4435624 missing values generated)

. recode egfr_cat 0=5 15=4 30=3 45=2 60=0, generate(ckd)
(13020891 differences between egfr_cat and ckd)

. * 0 = "No CKD"  2 "stage 3a" 3 "stage 3b" 4 "stage 4" 5 "stage 5"
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. label var ckd "CKD stage calc without eth"

. 
. * Convert into CKD group
. *recode ckd 2/5=1, gen(chronic_kidney_disease)
. *replace chronic_kidney_disease = 0 if creatinine==. 
. 
. recode ckd 0=1 2/3=2 4/5=3, gen(reduced_kidney_function_cat)
(12260694 differences between ckd and reduced_kidney_function_cat)

. replace reduced_kidney_function_cat = 1 if creatinine==. 
(4,435,624 real changes made)

. label define reduced_kidney_function_catlab ///
>         1 "None" 2 "Stage 3a/3b egfr 30-60      " 3 "Stage 4/5 egfr<30"

. label values reduced_kidney_function_cat reduced_kidney_function_catlab 

. 
. *More detailed version incorporating stage 5 or dialysis as a separate catego
> ry 
. recode ckd 0=1 2/3=2 4=3 5=4, gen(reduced_kidney_function_cat2)
(12260694 differences between ckd and reduced_kidney_function_cat2)

. replace reduced_kidney_function_cat2 = 1 if creatinine==. 
(4,435,624 real changes made)

. replace reduced_kidney_function_cat2 = 4 if dialysis==1 
(16,214 real changes made)

. 
. label define reduced_kidney_function_cat2lab ///
>         1 "None" 2 "Stage 3a/3b egfr 30-60      " 3 "Stage 4 egfr 15-<30" 4 "
> Stage 5 egfr <15 or dialysis"

. label values reduced_kidney_function_cat2 reduced_kidney_function_cat2lab 

.  
.         
. ************
. *   Hba1c  *
. ************
.         
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage<=0
(15,073,876 real changes made, 15,073,876 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol<=0
(8,153,248 real changes made, 8,153,248 to missing)

. 
. 
. local fifteenmbefore = `studystart'-15*(365.25/12)

. 
. * Only consider measurements in last 15 months
. replace hba1c_percentage   = . if hba1c_percentage_date   < `fifteenmbefore'
(1,544,972 real changes made, 1,544,972 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol_date < `fifteenmbefore'
(3,642,573 real changes made, 3,642,573 to missing)

. 
. 
. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |    837,667    6.044599    1.385648         .3        128
hba1c_mmol~l |  5,660,694    42.28378    12.23963         .4        471

. gen     hba1c_pct = hba1c_percentage 
(16,618,848 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(5,660,694 real changes made)

. 
. * Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(61 real changes made, 61 to missing)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(5,660,693 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(12,841,652 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(559,924 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(151,924 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(163,687 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(179,438 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. tab hba1ccat

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |  4,614,863       81.39       81.39
  >=6.5-7.4 |    559,924        9.88       91.27
  >=7.5-7.9 |    151,924        2.68       93.95
    >=8-8.9 |    163,687        2.89       96.84
        >=9 |    179,438        3.16      100.00
------------+-----------------------------------
      Total |  5,669,836      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if diabetes==0
(1,741,920 missing values generated)

. replace diabcat = 2 if diabetes==1 & inlist(hba1ccat, 0, 1)
(1,053,215 real changes made)

. replace diabcat = 3 if diabetes==1 & inlist(hba1ccat, 2, 3, 4)
(491,874 real changes made)

. replace diabcat = 4 if diabetes==1 & !inlist(hba1ccat, 0, 1, 2, 3, 4)
(196,831 real changes made)

. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "Controlled diabetes"      
>    ///
>                                                 3 "Uncontrolled diabetes"    
>    ///
>                                                 4 "Diabetes, no hba1c measure
> "

. label values diabcat diabcat

. 
. * Delete unneeded variables
. drop hba1c_pct hba1c_percentage hba1c_mmol_per_mol

. 
. 
. ********************************
. *  Outcomes and survival time  *
. ********************************
. 
. /*  Cohort entry and censor dates  */
. 
. * Date of cohort entry, 1 Feb 2020
. gen enter_date = `studystart'

. format %d enter_date

. 
. /*   Outcomes   */
. * Binary indicators for CPNS, primary care death outcome
. gen cpnsdeath           = (died_date_cpns               < .)

. gen primarycaredeath = (died_date_1ocare < .)

. 
. * Date of Covid death in ONS
. gen died_date_onscovid = died_date_ons if died_ons_covid_flag_any==1
(17,437,626 missing values generated)

. 
. *Classify ONS deaths
. if "`dataset'"!="2019"{
.         datacheck died_cause_ons!="" if died_date_ons<., nol
.         datacheck died_date_ons<. if died_cause_ons!="", nol
. 
.         gen _causechapter = substr(died_cause,1,1)
(17,304,104 missing values generated)
.         gen _causenumber = real(substr(died_cause,2,2))
(17,304,104 missing values generated)
.         gen onsdeath = 1 if _causechapter=="U" & _causenumber==07
(17,439,217 missing values generated)
.         replace onsdeath = 2 if _causechapter=="C" /*& !(_causenumber>=81 & _
> causenumber<=96)
>         replace onsdeath = 3 if _causechapter=="C" & (_causenumber>=81 & _cau
> senumber<=96)*/
(40,646 real changes made)
.         replace onsdeath = 3 if _causechapter=="I"
(34,605 real changes made)
.         replace onsdeath = 4 if (_causechapter=="F" & (_causenumber==0|_cause
> number==1|_causenumber==3))|(_causechapter=="G" & (_causenumber==30))
(17,015 real changes made)
.         replace onsdeath = 5 if _causechapter=="J" /*& (_causenumber>=9 & _ca
> usenumber<=22)
>         replace onsdeath = 7 if _causechapter=="J" & (_causenumber>=23)*/
(15,374 real changes made)
.         replace onsdeath = 6 if _causechapter!="" & onsdeath==.
(27,473 real changes made)
.         label define onsdeathlab 1 covid 2 cancer 3 cvd 4 dem_alz 5 respirato
> ry 6 other
.         label values onsdeath onsdeathlab 
. 
.         gen stime_cpnsdeath     = min($cpnsdeathcensor, died_date_cpns, died_
> date_ons)
.         gen stime_onsdeath              = min($onsdeathcensor, died_date_ons)
. 
.         replace cpnsdeath               = 0 if (died_date_cpns > $cpnsdeathce
> nsor) 
(587 real changes made)
.         replace onsdeath                = 0 if (died_date_ons > $onsdeathcens
> or) 
(17,305,136 real changes made)
. 
.         label var cpnsdeath                                             "Fail
> ure/censoring indicator for outcome: CPNS covid death"
.         label var onsdeath                                              "Fail
> ure/censoring indicator for outcome: ONS death (1 = covid death 2 = other dea
> th)"
note: label truncated to 80 characters
. 
.         label var  stime_cpnsdeath                              "Survival tim
> e (date); outcome CPNS covid death"
.         label var  stime_onsdeath                               "Survival tim
> e (date); outcome ONS covid death"
. }

. 
. gen stime_primarycaredeath              = min($primarycaredeathcensor, died_d
> ate_1ocare)

. replace primarycaredeath = 0 if (died_date_1ocare > $primarycaredeathcensor)
(10,493 real changes made)

. 
. * Format date variables
. format stime* %td 

. format  stime*                          ///
>                 died_date* %td 

. 
. *********************
. *  Label variables  *
. *********************
. 
. * Demographics
. label var patient_id                                    "Patient ID"

. label var age                                                   "Age (years)"

. label var agegroup                                              "Grouped age"

. label var age70                                                 "70 years and
>  older"

. label var male                                                  "Male"

. label var bmi                                                   "Body Mass In
> dex (BMI, kg/m2)"

. label var bmicat                                                "Grouped BMI"

. label var bmi_date                                      "Body Mass Index (BMI
> , kg/m2), date measured"

. label var obese4cat                                             "Evidence of 
> obesity (4 categories)"

. label var smoke                                                 "Smoking stat
> us"

. label var smoke_nomiss                                  "Smoking status (miss
> ing set to non)"

. label var imd                                                   "Index of Mul
> tiple Deprivation (IMD)"

. label var ethnicity                                             "Ethnicity"

. label var ethnicity_16                                  "Ethnicity in 16 cate
> gories"

. label var ethnicity_16_combinemixed             "Ethnicity detailed with mixe
> d groups combined"

. label var stp                                                   "Sustainabili
> ty and Transformation Partnership"

. label var region                                                "Geographical
>  region"

. 
. label var hba1ccat                                              "Categorised 
> hba1c"

. label var egfr_cat                                              "Calculated e
> GFR"

.         
. label var bp_sys                                                "Systolic blo
> od pressure"

. label var bp_sys_date                                   "Systolic blood press
> ure, date"

. label var bp_dias                                               "Diastolic bl
> ood pressure"

. label var bp_dias_date                                  "Diastolic blood pres
> sure, date"

. label var bpcat                                                 "Grouped bloo
> d pressure"

. label var bphigh                                                "Binary high 
> (stage 1/2) blood pressure"

. label var htdiag_or_highbp                              "Diagnosed hypertensi
> on or high blood pressure"

. 
. label var age1                                                  "Age spline 1
> "

. label var age2                                                  "Age spline 2
> "

. label var age3                                                  "Age spline 3
> "

. label var c_age                                                 "Centred age"

. label var c_male                                                "Centred sex 
> (code: -1/+1)"

. label var c_imd                                                 "Centred Inde
> x of Multiple Deprivation (values: -2/+2)"

. label var c_ethnicity                                   "Centred ethnicity (v
> alues: -2/+2)"

. 
. * Comorbidities
. label var chronic_respiratory_disease   "Respiratory disease (excl. asthma)"

. label var asthmacat                                             "Asthma, grou
> ped by severity (OCS use)"

. label var asthma                                                "Asthma"

. label var chronic_cardiac_disease               "Heart disease"

. label var diabetes                                              "Diabetes"

. label var diabcat                                               "Diabetes, gr
> ouped"

. label var cancer_exhaem_cat                             "Cancer (exc. haemato
> logical), grouped by time since diagnosis"

. label var cancer_haem_cat                               "Haematological malig
> nancy, grouped by time since diagnosis"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var stroke_dementia                               "Stroke or dementia"

. label var other_neuro                                   "Neuro condition othe
> r than stroke/dementia"    

. label var reduced_kidney_function_cat   "Reduced kidney function" 

. label var organ_transplant                              "Organ transplant rec
> ipient"

. label var dysplenia                                             "Dysplenia (s
> plenectomy, other, not sickle cell)"

. label var sickle_cell                                   "Sickle cell"

. label var spleen                                                "Spleen probl
> ems (dysplenia, sickle cell)"

. label var ra_sle_psoriasis                              "RA, SLE, Psoriasis (
> autoimmune disease)"

. label var aplastic_anaemia                              "Aplastic anaemia"

. label var hiv                                                   "HIV"

. label var permanent_immunodeficiency    "Permanent immunodeficiency"

. label var temporary_immunodeficiency    "Temporary immunosuppression"

. label var other_immunosuppression               "Immunosuppressed (combinatio
> n algorithm)"

. label var chronic_respiratory_disease_date      "Respiratory disease (excl. a
> sthma), date"

. label var chronic_cardiac_disease_date  "Heart disease, date"

. label var diabetes_date                                 "Diabetes, date"

. label var lung_cancer_date                              "Lung cancer, date"

. label var haem_cancer_date                              "Haem. cancer, date"

. label var other_cancer_date                             "Any cancer, date"

. label var chronic_liver_disease_date    "Liver, date"

. label var stroke_date                                   "Stroke, date"

. label var dementia_date                                 "Dementia, date"

. label var other_neuro_date                              "Neuro condition othe
> r than stroke/dementia, date"      

. label var organ_transplant_date                 "Organ transplant recipient, 
> date"

. label var dysplenia_date                                "Splenectomy etc, dat
> e"

. label var sickle_cell_date                              "Sickle cell, date"

. label var ra_sle_psoriasis_date                 "RA, SLE, Psoriasis (autoimmu
> ne disease), date"

. label var aplastic_anaemia_date                 "Aplastic anaemia, date"

. label var hiv_date                                              "HIV, date"

. label var permanent_immunodeficiency_date "Permanent immunodeficiency, date"

. label var temporary_immunodeficiency_date "Temporary immunosuppression, date"

. label var dialysis                                              "Dialysis"

.         
. * Outcomes and follow-up
. label var enter_date                                    "Date of study entry"

. 
. 
. ***************
. *  Tidy data  *
. ***************
. 
. * REDUCE DATASET SIZE TO VARIABLES NEEDED
. keep patient_id imd stp region enter_date                                    
>                                    ///
>         *death died* stime*                                                  
>                                    ///
>         age agegroup age70 age1 age2 age3 male bmi smoke                     
>                            ///
>         smoke smoke_nomiss bmicat bpcat_nomiss obese4cat ethnicity ethnicity_
> 16 ///
>         ethnicity_16_combinemixed bpcat bphigh htdiag_or_highbp hypertension 
>    ///
>         chronic_respiratory_disease asthma asthmacat chronic_cardiac_disease 
>    ///
>         diabetes diabcat hba1ccat cancer_exhaem_cat cancer_haem_cat          
>            ///
>         chronic_liver_disease organ_transplant spleen ra_sle_psoriasis       
>            ///
>         reduced_kidney_function_cat* stroke dementia stroke_dementia         
>            ///
>         other_neuro other_immunosuppression  hiv*                            
>                                    ///
>         creatinine egfr egfr_cat ckd dialysis 

. 
. 
. ***************
. *  Save data  *
. ***************
. 
. sort patient_id

. 
. if "`dataset'"=="MAIN" |"`dataset'"=="SEPT2020" stset stime_onsdeath, fail(on
> sdeath) id(patient_id) enter(enter_date) origin(enter_date)

                id:  patient_id
     failure event:  onsdeath != 0 & onsdeath < .
obs. time interval:  (stime_onsdeath[_n-1], stime_onsdeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
   17456515  total observations
          0  exclusions
------------------------------------------------------------------------------
   17456515  observations remaining, representing
   17456515  subjects
    151,379  failures in single-failure-per-subject data
 4.9000e+09  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       282

. if "`dataset'"=="2019" stset stime_primarycaredeath, fail(primarycaredeath) i
> d(patient_id) enter(enter_date) origin(enter_date)

. assert _st==1

. save ./analysis/cr_create_analysis_dataset_`dataset'_STSET.dta, replace
(note: file ./analysis/cr_create_analysis_dataset_MAIN_STSET.dta not found)
file ./analysis/cr_create_analysis_dataset_MAIN_STSET.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/analysis/output/cr_create_analysis_dataset.log
  log type:  text
 closed on:  14 Dec 2020, 11:50:37
-------------------------------------------------------------------------------
