------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  c:\github\covid-vs-noncovid-deaths-research\analysis/output/an_covidvsnoncovid_full.log
  log type:  text
 opened on:   9 Dec 2020, 18:39:47

. 
. use  ./analysis/cr_create_analysis_dataset_STSET_ONSCSDEATH.dta, clear
(covid vs noncovid 2020)

.         
. gen coviddeath = onsdeath==1 if  _d==1
(7,569 missing values generated)

. replace coviddeath= 0 if _d==0
(7,569 real changes made)

. gen noncoviddeath = onsdeath>1 if _d==1
(7,569 missing values generated)

. replace noncoviddeath= 0 if _d==0
(7,569 real changes made)

.         
. **MULTIVARIATE
. cap prog drop baselogistic 

. prog define baselogistic
  1.         syntax , outcome(string) age(string) bp(string) [ethnicity(real 0) if(string)] 
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. 
. cap logistic `outcome' `age'                    ///
>                         i.male                                                  ///
>                         i.obese4cat                                             ///
>                         i.smoke_nomiss                                  ///
>                         `ethnicity'                                             ///
>                         i.imd                                                   ///
>                         `bp'                                                    ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthmacat                                             ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabcat                                               ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke                                                ///     
>                         i.dementia                                              ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat2  ///
>                         i.organ_transplant                              ///
>                         i.spleen                                                ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immunosuppression
  5.                         
. end                     

. 
. baselogistic, outcome(coviddeath) age("age1 age2 age3")  bp("i.htdiag_or_highbp") ethnicity(0)

. if _rc==0{
. estimates

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

note: 2.asthmacat != 0 predicts failure perfectly
      2.asthmacat dropped and 149 obs not used
note: 2bn.diabcat != 0 predicts failure perfectly
      2bn.diabcat dropped and 67 obs not used
note: 3.diabcat != 0 predicts failure perfectly
      3.diabcat dropped and 13 obs not used
note: 2.cancer_haem_cat != 0 predicts failure perfectly
      2.cancer_haem_cat dropped and 28 obs not used

Logistic regression                             Number of obs     =      7,611
                                                LR chi2(31)       =      24.21
                                                Prob > chi2       =     0.8019
Log likelihood =  -347.8753                     Pseudo R2         =     0.0336

-----------------------------------------------------------------------------------------------
                   coviddeath | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                         age1 |   .9858628   .0332467    -0.42   0.673     .9228074    1.053227
                         age2 |   1.001366   .1221354     0.01   0.991     .7884476    1.271783
                         age3 |    1.05721   .3438111     0.17   0.864     .5589146    1.999757
                       1.male |   .6790984   .1793021    -1.47   0.143     .4047532    1.139397
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.377584   .4422409     1.00   0.318     .7342769    2.584498
          Obese II (35-39.9)  |   .8812736   .3302242    -0.34   0.736     .4228195     1.83682
             Obese III (40+)  |    .671321   .2511855    -1.07   0.287     .3224331    1.397722
                              |
                 smoke_nomiss |
                      Former  |   1.503072   1.095767     0.56   0.576     .3601128    6.273663
                     Current  |   1.291825   .4716958     0.70   0.483     .6315342    2.642474
                              |
                          imd |
                           4  |   1.049845   .3354045     0.15   0.879      .561285    1.963664
             5 most deprived  |   .9363918   .4112662    -0.15   0.881     .3959198    2.214665
                              |
           1.htdiag_or_highbp |   2.630726   1.897753     1.34   0.180     .6397879    10.81721
1.chronic_respiratory_disease |     1.5688   .4518762     1.56   0.118     .8920471    2.758971
                              |
                    asthmacat |
                 Yes, no OCS  |          1  (empty)
                Yes with OCS  |   .7297353    .740676    -0.31   0.756     .0998164    5.334929
                              |
    1.chronic_cardiac_disease |     1.5088   .4347412     1.43   0.153     .8577664     2.65396
                              |
                      diabcat |
         Controlled diabetes  |          1  (empty)
       Uncontrolled diabetes  |          1  (empty)
  Diabetes, no hba1c measure  |   1.047157   .3395163     0.14   0.887     .5546631    1.976942
                              |
            cancer_exhaem_cat |
                   Last year  |   2.043237   2.105399     0.69   0.488     .2711569    15.39631
               2-5 years ago  |   1.089137   .7958371     0.12   0.907     .2600792    4.560991
                    5+ years  |   .9956154   .2798727    -0.02   0.988     .5738712    1.727304
                              |
              cancer_haem_cat |
                   Last year  |          1  (empty)
               2-5 years ago  |   1.059097   1.078389     0.06   0.955     .1439556    7.791889
                    5+ years  |   .6908838   .2637513    -0.97   0.333     .3269271    1.460021
                              |
      1.chronic_liver_disease |   .6878757   .2497345    -1.03   0.303     .3376601    1.401329
                     1.stroke |    1.24545   .3728232     0.73   0.463     .6926607    2.239401
                   1.dementia |    .962597   .3124729    -0.12   0.907     .5094859    1.818682
                1.other_neuro |   .5931885   .2260492    -1.37   0.171     .2810744    1.251884
                              |
 reduced_kidney_function_cat2 |
Stage 3a/3b egfr 30-60        |   1.485054   1.547299     0.38   0.704     .1926919    11.44515
Stage 5 egfr <15 or dialysis  |   1.610082    .464497     1.65   0.099     .9147077    2.834089
                              |
           1.organ_transplant |   .8477619   .2840429    -0.49   0.622     .4396212    1.634817
                     1.spleen |   .7910383   .2197787    -0.84   0.399     .4588844    1.363615
           1.ra_sle_psoriasis |   .7538533    .262308    -0.81   0.417     .3811588    1.490966
    1.other_immunosuppression |   1.040731   .2761756     0.15   0.880     .6186679     1.75073
                        _cons |   .0062081   .0076967    -4.10   0.000     .0005466    .0705117
-----------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
. estimates save ./analysis/output/models/an_covidvsnoncovid_full_covid_agespline_bmicat_noeth, replace
file ./analysis/output/models/an_covidvsnoncovid_full_covid_agespline_bmicat_noeth.ster saved
. }

. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"

.  
. *Age group model (not adj ethnicity)
. baselogistic, outcome(coviddeath) age("ib3.agegroup") bp("i.htdiag_or_highbp") ethnicity(0)

. if _rc==0{
. estimates

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

note: 2.asthmacat != 0 predicts failure perfectly
      2.asthmacat dropped and 149 obs not used
note: 2bn.diabcat != 0 predicts failure perfectly
      2bn.diabcat dropped and 67 obs not used
note: 3.diabcat != 0 predicts failure perfectly
      3.diabcat dropped and 13 obs not used
note: 2.cancer_haem_cat != 0 predicts failure perfectly
      2.cancer_haem_cat dropped and 28 obs not used

Logistic regression                             Number of obs     =      7,611
                                                LR chi2(33)       =      24.22
                                                Prob > chi2       =     0.8666
Log likelihood = -347.86957                     Pseudo R2         =     0.0336

-----------------------------------------------------------------------------------------------
                   coviddeath | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                     agegroup |
                      18-<40  |   1.487358   .6114781     0.97   0.334     .6644646    3.329346
                      40-<50  |   1.361293   .6501253     0.65   0.518     .5338703    3.471105
                      60-<70  |   1.307605   .6591509     0.53   0.595     .4868491    3.512036
                      70-<80  |   1.385265   .7237991     0.62   0.533     .4974861     3.85731
                         80+  |   1.938942   1.124726     1.14   0.254     .6220235    6.043981
                              |
                       1.male |   .6759362   .1784905    -1.48   0.138     .4028412    1.134168
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.384232   .4444506     1.01   0.311     .7377417    2.597249
          Obese II (35-39.9)  |   .8851355   .3317847    -0.33   0.745     .4245657    1.845332
             Obese III (40+)  |   .6737825    .252179    -1.05   0.291     .3235471    1.403143
                              |
                 smoke_nomiss |
                      Former  |   1.496236    1.09196     0.55   0.581     .3579224    6.254768
                     Current  |   1.306073   .4767428     0.73   0.464     .6386486    2.670995
                              |
                          imd |
                           4  |   1.044303   .3336969     0.14   0.892      .558256    1.953528
             5 most deprived  |   .9355521   .4108828    -0.15   0.879     .3955768    2.212611
                              |
           1.htdiag_or_highbp |   2.657805   1.917751     1.35   0.176     .6461523    10.93229
1.chronic_respiratory_disease |   1.567578   .4516042     1.56   0.119     .8912637    2.757098
                              |
                    asthmacat |
                 Yes, no OCS  |          1  (empty)
                Yes with OCS  |   .7246968   .7355916    -0.32   0.751     .0991193    5.298519
                              |
    1.chronic_cardiac_disease |   1.503791   .4333158     1.42   0.157     .8548989    2.645211
                              |
                      diabcat |
         Controlled diabetes  |          1  (empty)
       Uncontrolled diabetes  |          1  (empty)
  Diabetes, no hba1c measure  |   1.051531   .3411829     0.15   0.877     .5567228     1.98612
                              |
            cancer_exhaem_cat |
                   Last year  |   2.041358   2.103184     0.69   0.489     .2709802    15.37803
               2-5 years ago  |   1.070457   .7827549     0.09   0.926     .2553531    4.487424
                    5+ years  |   .9915623   .2788051    -0.03   0.976      .571454    1.720516
                              |
              cancer_haem_cat |
                   Last year  |          1  (empty)
               2-5 years ago  |   1.071653   1.091596     0.07   0.946     .1455499     7.89035
                    5+ years  |   .6922627   .2642991    -0.96   0.335     .3275598    1.463023
                              |
      1.chronic_liver_disease |   .6890935   .2501837    -1.03   0.305     .3382511    1.403838
                     1.stroke |   1.239359   .3711718     0.72   0.474      .689086    2.229055
                   1.dementia |   .9633441   .3127404    -0.12   0.908     .5098554    1.820186
                1.other_neuro |   .5930171   .2260827    -1.37   0.170     .2809014    1.251931
                              |
 reduced_kidney_function_cat2 |
Stage 3a/3b egfr 30-60        |   1.457683   1.517637     0.36   0.717     .1894314    11.21693
Stage 5 egfr <15 or dialysis  |    1.60761   .4637711     1.65   0.100     .9133175    2.829694
                              |
           1.organ_transplant |   .8481559   .2842486    -0.49   0.623     .4397505    1.635856
                     1.spleen |   .7901734   .2195542    -0.85   0.397     .4583647    1.362177
           1.ra_sle_psoriasis |   .7548073   .2626724    -0.81   0.419      .381609    1.492979
    1.other_immunosuppression |   1.038563   .2755875     0.14   0.887     .6173943    1.747041
                        _cons |   .0027028   .0023035    -6.94   0.000     .0005086    .0143635
-----------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
. estimates save ./analysis/output/models/an_covidvsnoncovid_full_covid_agegroup_bmicat_noeth, replace
file ./analysis/output/models/an_covidvsnoncovid_full_covid_agegroup_bmicat_noeth.ster saved
. }

. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"

. 
. *Complete case ethnicity model
. baselogistic, outcome(coviddeath) age("age1 age2 age3") bp("i.htdiag_or_highbp") ethnicity(1)

. if _rc==0{
. estimates

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

note: 2.smoke_nomiss != 0 predicts failure perfectly
      2.smoke_nomiss dropped and 124 obs not used
note: 2.asthmacat != 0 predicts failure perfectly
      2.asthmacat dropped and 111 obs not used
note: 2bn.diabcat != 0 predicts failure perfectly
      2bn.diabcat dropped and 44 obs not used
note: 3.diabcat != 0 predicts failure perfectly
      3.diabcat dropped and 12 obs not used
note: 2.cancer_exhaem_cat != 0 predicts failure perfectly
      2.cancer_exhaem_cat dropped and 46 obs not used
note: 2.cancer_haem_cat != 0 predicts failure perfectly
      2.cancer_haem_cat dropped and 24 obs not used

Logistic regression                             Number of obs     =      5,522
                                                LR chi2(33)       =      30.35
                                                Prob > chi2       =     0.5997
Log likelihood = -274.50711                     Pseudo R2         =     0.0524

-----------------------------------------------------------------------------------------------
                   coviddeath | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                         age1 |   .9920858    .037704    -0.21   0.834     .9208725    1.068806
                         age2 |   1.011721   .1393516     0.08   0.933     .7723581    1.325266
                         age3 |   .9698141   .3590095    -0.08   0.934     .4694479    2.003501
                       1.male |   .7020701   .2049864    -1.21   0.226     .3961426    1.244255
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.086074   .4009513     0.22   0.823     .5267656    2.239246
          Obese II (35-39.9)  |   .7719787   .3190663    -0.63   0.531     .3433962    1.735462
             Obese III (40+)  |   .6083491   .2507765    -1.21   0.228     .2711856    1.364706
                              |
                 smoke_nomiss |
                      Former  |          1  (empty)
                     Current  |   1.660162   .6200669     1.36   0.175     .7984149    3.452013
                              |
                    ethnicity |
                       Mixed  |   2.103611    1.02927     1.52   0.129     .8062754     5.48842
      Asian or Asian British  |   2.163734   1.055169     1.58   0.113     .8319671    5.627322
                       Black  |   .4005398   .4085443    -0.90   0.370     .0542542    2.957045
                       Other  |    1.09146   .5275727     0.18   0.856     .4232213    2.814804
                              |
                          imd |
                           4  |   1.331499    .441736     0.86   0.388     .6949404    2.551139
             5 most deprived  |   1.027055   .4988434     0.05   0.956     .3964268    2.660876
                              |
           1.htdiag_or_highbp |   2.086686    1.51499     1.01   0.311     .5028774     8.65869
1.chronic_respiratory_disease |   1.669984    .522871     1.64   0.101      .904069    3.084772
                              |
                    asthmacat |
                 Yes, no OCS  |          1  (empty)
                Yes with OCS  |   .9807016    1.00005    -0.02   0.985     .1329051    7.236558
                              |
    1.chronic_cardiac_disease |   1.490306    .475654     1.25   0.211      .797263    2.785797
                              |
                      diabcat |
         Controlled diabetes  |          1  (empty)
       Uncontrolled diabetes  |          1  (empty)
  Diabetes, no hba1c measure  |   1.029864   .3682613     0.08   0.934     .5109812    2.075652
                              |
            cancer_exhaem_cat |
                   Last year  |          1  (empty)
               2-5 years ago  |   1.242755   .9172785     0.29   0.768     .2924913    5.280293
                    5+ years  |   .8733547   .2794393    -0.42   0.672      .466487     1.63509
                              |
              cancer_haem_cat |
                   Last year  |          1  (empty)
               2-5 years ago  |   1.178842   1.208428     0.16   0.872     .1580849     8.79064
                    5+ years  |   .5079973   .2412374    -1.43   0.154     .2002827    1.288485
                              |
      1.chronic_liver_disease |   .7507229   .2923947    -0.74   0.462      .349905     1.61068
                     1.stroke |   1.174104   .3931841     0.48   0.632     .6090541    2.263378
                   1.dementia |    .876635   .3260565    -0.35   0.723     .4228847    1.817254
                1.other_neuro |   .7164237   .2790796    -0.86   0.392     .3338783    1.537275
                              |
 reduced_kidney_function_cat2 |
Stage 3a/3b egfr 30-60        |    2.43164   2.581399     0.84   0.403     .3035806    19.47711
Stage 5 egfr <15 or dialysis  |   1.951354     .60262     2.16   0.030     1.065288    3.574418
                              |
           1.organ_transplant |   .7553374    .294202    -0.72   0.471     .3520466    1.620622
                     1.spleen |   .6231577    .202218    -1.46   0.145     .3298972    1.177111
           1.ra_sle_psoriasis |   .8942268   .3200653    -0.31   0.755     .4433862    1.803488
    1.other_immunosuppression |   1.051685   .3087181     0.17   0.864     .5915871    1.869617
                        _cons |   .0068647   .0092348    -3.70   0.000     .0004915     .095877
-----------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
. estimates save ./analysis/output/models/an_covidvsnoncovid_full_covid_agespline_bmicat_CCeth, replace
file ./analysis/output/models/an_covidvsnoncovid_full_covid_agespline_bmicat_CCeth.ster saved
.  }

.  else di "WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')"

.  
.  ***
. 
. baselogistic, outcome(noncoviddeath) age("age1 age2 age3")  bp("i.htdiag_or_highbp") ethnicity(0)

. if _rc==0{
. estimates

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

note: 3.diabcat != 0 predicts failure perfectly
      3.diabcat dropped and 13 obs not used
note: 2.cancer_haem_cat != 0 predicts failure perfectly
      2.cancer_haem_cat dropped and 30 obs not used

Logistic regression                             Number of obs     =      7,825
                                                LR chi2(33)       =      50.72
                                                Prob > chi2       =     0.0250
Log likelihood = -1036.8078                     Pseudo R2         =     0.0239

-----------------------------------------------------------------------------------------------
                noncoviddeath | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                         age1 |   .9867271   .0187185    -0.70   0.481     .9507131    1.024105
                         age2 |   1.055871   .0698282     0.82   0.411      .927509    1.201997
                         age3 |   .8955647    .155666    -0.63   0.526     .6370039    1.259076
                       1.male |   .9205774   .1228878    -0.62   0.535     .7086528    1.195879
                              |
                    obese4cat |
           Obese I (30-34.9)  |    .949059   .1778418    -0.28   0.780     .6573379    1.370244
          Obese II (35-39.9)  |   1.084305   .1958556     0.45   0.654     .7610282    1.544906
             Obese III (40+)  |   .8261421   .1486928    -1.06   0.289      .580566    1.175595
                              |
                 smoke_nomiss |
                      Former  |   .8372927   .3862518    -0.38   0.700     .3390074    2.067976
                     Current  |   .5539959    .141501    -2.31   0.021       .33581    .9139439
                              |
                          imd |
                           4  |   .9696761   .1614126    -0.18   0.853     .6997378    1.343749
             5 most deprived  |   .5148119   .1447358    -2.36   0.018     .2967147     .893219
                              |
           1.htdiag_or_highbp |   .7231695   .1572892    -1.49   0.136      .472176    1.107583
1.chronic_respiratory_disease |   1.169117   .1881329     0.97   0.332     .8528711    1.602626
                              |
                    asthmacat |
                 Yes, no OCS  |   2.248066   .7997586     2.28   0.023     1.119414    4.514685
                Yes with OCS  |   1.451993   .5730395     0.94   0.345     .6699332    3.147004
                              |
    1.chronic_cardiac_disease |   .8325088   .1458113    -1.05   0.295     .5906137    1.173476
                              |
                      diabcat |
         Controlled diabetes  |   1.005721   .7306804     0.01   0.994     .2421359    4.177302
       Uncontrolled diabetes  |          1  (empty)
  Diabetes, no hba1c measure  |   1.113821   .1845436     0.65   0.515     .8049777    1.541157
                              |
            cancer_exhaem_cat |
                   Last year  |   1.565097   .9432158     0.74   0.457     .4803512    5.099451
               2-5 years ago  |   .5309971   .2719252    -1.24   0.216     .1946208    1.448755
                    5+ years  |   .8537144   .1258714    -1.07   0.283     .6394575     1.13976
                              |
              cancer_haem_cat |
                   Last year  |          1  (empty)
               2-5 years ago  |   1.663169   .7169857     1.18   0.238     .7144746     3.87156
                    5+ years  |    1.07416   .1838289     0.42   0.676     .7680625    1.502247
                              |
      1.chronic_liver_disease |   1.260164   .1974229     1.48   0.140     .9269876     1.71309
                     1.stroke |   .9250197   .1563129    -0.46   0.645     .6642203    1.288219
                   1.dementia |   .8722512   .1512711    -0.79   0.431      .620899    1.225356
                1.other_neuro |   1.439488   .2195374     2.39   0.017     1.067556       1.941
                              |
 reduced_kidney_function_cat2 |
Stage 3a/3b egfr 30-60        |   .5447376   .3977334    -0.83   0.405     .1302246    2.278671
Stage 5 egfr <15 or dialysis  |   .9063461   .1560426    -0.57   0.568     .6467635    1.270114
                              |
           1.organ_transplant |   .7605007   .1372021    -1.52   0.129     .5339913    1.083091
                     1.spleen |   .8687634    .122545    -1.00   0.319     .6589216    1.145432
           1.ra_sle_psoriasis |   1.225592    .195657     1.27   0.203     .8963088    1.675846
    1.other_immunosuppression |   1.060011   .1459217     0.42   0.672     .8093446    1.388312
                        _cons |   .0610876    .037216    -4.59   0.000     .0185089    .2016161
-----------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
. estimates save ./analysis/output/models/an_covidvsnoncovid_full_noncovid_agespline_bmicat_noeth, replace
file ./analysis/output/models/an_covidvsnoncovid_full_noncovid_agespline_bmicat_noeth.ster saved
. }

. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"

.  
. *Age group model (not adj ethnicity)
. baselogistic, outcome(noncoviddeath) age("ib3.agegroup") bp("i.htdiag_or_highbp") ethnicity(0)

. if _rc==0{
. estimates

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

note: 3.diabcat != 0 predicts failure perfectly
      3.diabcat dropped and 13 obs not used
note: 2.cancer_haem_cat != 0 predicts failure perfectly
      2.cancer_haem_cat dropped and 30 obs not used

Logistic regression                             Number of obs     =      7,825
                                                LR chi2(35)       =      55.28
                                                Prob > chi2       =     0.0159
Log likelihood = -1034.5278                     Pseudo R2         =     0.0260

-----------------------------------------------------------------------------------------------
                noncoviddeath | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                     agegroup |
                      18-<40  |   .9439631   .1846752    -0.29   0.768     .6433207    1.385104
                      40-<50  |   .6880071   .1734746    -1.48   0.138     .4197303    1.127757
                      60-<70  |   1.001677    .243334     0.01   0.994     .6222264    1.612528
                      70-<80  |   1.616508   .3698719     2.10   0.036     1.032322    2.531283
                         80+  |   1.288029   .3821671     0.85   0.394     .7200592    2.304003
                              |
                       1.male |   .9182776   .1225752    -0.64   0.523     .7068907    1.192877
                              |
                    obese4cat |
           Obese I (30-34.9)  |   .9451557   .1772139    -0.30   0.764     .6544939    1.364901
          Obese II (35-39.9)  |   1.082064   .1956099     0.44   0.663     .7592365    1.542157
             Obese III (40+)  |   .8308184    .149682    -1.03   0.304     .5836491    1.182661
                              |
                 smoke_nomiss |
                      Former  |   .8201244   .3787588    -0.43   0.668     .3317176     2.02764
                     Current  |   .5486446   .1401965    -2.35   0.019     .3324922    .9053171
                              |
                          imd |
                           4  |    .973791    .162192    -0.16   0.873     .7025738    1.349707
             5 most deprived  |   .5169577   .1453638    -2.35   0.019     .2979236    .8970263
                              |
           1.htdiag_or_highbp |   .7247684   .1578109    -1.48   0.139     .4729975    1.110554
1.chronic_respiratory_disease |   1.168979   .1882657     0.97   0.332     .8525489    1.602854
                              |
                    asthmacat |
                 Yes, no OCS  |   2.225246   .7931965     2.24   0.025     1.106533    4.474986
                Yes with OCS  |   1.468468   .5801622     0.97   0.331     .6769742     3.18535
                              |
    1.chronic_cardiac_disease |   .8366951   .1466342    -1.02   0.309      .593459    1.179624
                              |
                      diabcat |
         Controlled diabetes  |   .9974301   .7255112    -0.00   0.997      .239737    4.149826
       Uncontrolled diabetes  |          1  (empty)
  Diabetes, no hba1c measure  |    1.10311   .1829187     0.59   0.554     .7970248    1.526743
                              |
            cancer_exhaem_cat |
                   Last year  |   1.571517   .9471084     0.75   0.453     .4823075    5.120518
               2-5 years ago  |   .5263809   .2696407    -1.25   0.210     .1928718    1.436586
                    5+ years  |   .8473305    .124981    -1.12   0.261     .6346012     1.13137
                              |
              cancer_haem_cat |
                   Last year  |          1  (empty)
               2-5 years ago  |   1.592277   .6888364     1.08   0.282     .6819927    3.717558
                    5+ years  |   1.065206   .1824043     0.37   0.712      .761509     1.49002
                              |
      1.chronic_liver_disease |   1.258439   .1972843     1.47   0.143     .9255297    1.711096
                     1.stroke |    .928652   .1570263    -0.44   0.662     .6666883     1.29355
                   1.dementia |   .8727178   .1514257    -0.78   0.433     .6211285    1.226214
                1.other_neuro |   1.451063   .2214845     2.44   0.015     1.075876    1.957088
                              |
 reduced_kidney_function_cat2 |
Stage 3a/3b egfr 30-60        |   .5523778   .4032469    -0.81   0.416     .1320815    2.310098
Stage 5 egfr <15 or dialysis  |   .9088035    .156524    -0.56   0.579     .6484356    1.273717
                              |
           1.organ_transplant |   .7569101   .1365735    -1.54   0.123     .5314436    1.078031
                     1.spleen |   .8627411   .1218018    -1.05   0.296     .6541959    1.137767
           1.ra_sle_psoriasis |   1.235516   .1973796     1.32   0.186     .9033685    1.689787
    1.other_immunosuppression |   1.064076    .146625     0.45   0.652     .8122331    1.394005
                        _cons |   .0480926   .0147878    -9.87   0.000     .0263236    .0878639
-----------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
. estimates save ./analysis/output/models/an_covidvsnoncovid_full_noncovid_agegroup_bmicat_noeth, replace
file ./analysis/output/models/an_covidvsnoncovid_full_noncovid_agegroup_bmicat_noeth.ster saved
. }

. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"

. 
. *Complete case ethnicity model
. baselogistic, outcome(noncoviddeath) age("age1 age2 age3") bp("i.htdiag_or_highbp") ethnicity(1)

. if _rc==0{
. estimates

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

note: 3.diabcat != 0 predicts failure perfectly
      3.diabcat dropped and 12 obs not used
note: 2.cancer_haem_cat != 0 predicts failure perfectly
      2.cancer_haem_cat dropped and 25 obs not used

Logistic regression                             Number of obs     =      5,846
                                                LR chi2(37)       =      53.40
                                                Prob > chi2       =     0.0396
Log likelihood = -824.74199                     Pseudo R2         =     0.0314

-----------------------------------------------------------------------------------------------
                noncoviddeath | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                         age1 |   .9852075   .0211448    -0.69   0.487      .944624    1.027535
                         age2 |   1.062193   .0787672     0.81   0.416     .9185068    1.228357
                         age3 |   .8888009   .1720962    -0.61   0.543     .6081189    1.299034
                       1.male |   .9701029   .1435475    -0.21   0.837     .7258791    1.296496
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.026106   .2101027     0.13   0.900     .6869141    1.532788
          Obese II (35-39.9)  |   1.034248   .2119354     0.16   0.869     .6921477    1.545435
             Obese III (40+)  |   .8533545   .1697729    -0.80   0.425     .5778098      1.2603
                              |
                 smoke_nomiss |
                      Former  |   .8532912   .4436352    -0.31   0.760     .3079985    2.363992
                     Current  |   .5121379   .1494688    -2.29   0.022     .2890423    .9074285
                              |
                    ethnicity |
                       Mixed  |   .9607952   .3384801    -0.11   0.910     .4816811     1.91647
      Asian or Asian British  |   1.251541   .3870751     0.73   0.468     .6826315    2.294583
                       Black  |   1.082175   .3637442     0.23   0.814     .5600011    2.091251
                       Other  |   .8024828   .2158336    -0.82   0.413      .473695    1.359479
                              |
                          imd |
                           4  |   1.037129   .1873096     0.20   0.840     .7279515    1.477621
             5 most deprived  |   .5065099   .1607497    -2.14   0.032      .271922    .9434773
                              |
           1.htdiag_or_highbp |   .9124477   .2385617    -0.35   0.726     .5465869    1.523199
1.chronic_respiratory_disease |   1.285109   .2252542     1.43   0.152     .9114677    1.811919
                              |
                    asthmacat |
                 Yes, no OCS  |   2.297289   .8762392     2.18   0.029     1.087797    4.851585
                Yes with OCS  |   1.789796   .7202164     1.45   0.148     .8133527    3.938476
                              |
    1.chronic_cardiac_disease |   .8862852   .1679522    -0.64   0.524     .6113214    1.284924
                              |
                      diabcat |
         Controlled diabetes  |   1.261299   .9306136     0.31   0.753     .2970185    5.356151
       Uncontrolled diabetes  |          1  (empty)
  Diabetes, no hba1c measure  |   .9993584   .1897749    -0.00   0.997     .6887805    1.449979
                              |
            cancer_exhaem_cat |
                   Last year  |   1.305821    .958611     0.36   0.716     .3097502     5.50498
               2-5 years ago  |   .1546676   .1558984    -1.85   0.064     .0214498    1.115256
                    5+ years  |   .8769777   .1427932    -0.81   0.420     .6373711    1.206659
                              |
              cancer_haem_cat |
                   Last year  |          1  (empty)
               2-5 years ago  |    1.93456   .8474625     1.51   0.132     .8197868     4.56524
                    5+ years  |   1.113741    .209553     0.57   0.567     .7702446    1.610422
                              |
      1.chronic_liver_disease |   1.355342   .2312789     1.78   0.075     .9700579    1.893651
                     1.stroke |   .9217343   .1724155    -0.44   0.663     .6388277    1.329927
                   1.dementia |   .8742125   .1689427    -0.70   0.487     .5985786     1.27677
                1.other_neuro |   1.309725   .2245284     1.57   0.116       .93596    1.832749
                              |
 reduced_kidney_function_cat2 |
Stage 3a/3b egfr 30-60        |   .6276916   .4629693    -0.63   0.528     .1478842    2.664224
Stage 5 egfr <15 or dialysis  |   .9744882    .183031    -0.14   0.891     .6743753    1.408158
                              |
           1.organ_transplant |    .740707   .1506064    -1.48   0.140     .4972485    1.103366
                     1.spleen |   .8437263   .1324843    -1.08   0.279     .6202167    1.147783
           1.ra_sle_psoriasis |   1.303259   .2265188     1.52   0.128     .9270088     1.83222
    1.other_immunosuppression |   1.032566   .1584404     0.21   0.835     .7643752    1.394855
                        _cons |   .0510068   .0353294    -4.30   0.000     .0131236    .1982461
-----------------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
. estimates save ./analysis/output/models/an_covidvsnoncovid_full_noncovid_agespline_bmicat_CCeth, replace
file ./analysis/output/models/an_covidvsnoncovid_full_noncovid_agespline_bmicat_CCeth.ster saved
.  }

.  else di "WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')"

.  
.  *** 
.  
.  log close
      name:  <unnamed>
       log:  c:\github\covid-vs-noncovid-deaths-research\analysis/output/an_covidvsnoncovid_full.log
  log type:  text
 closed on:   9 Dec 2020, 18:39:49
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
